[
    {
        "name": "JavaScript高级程序设计",
        "describe": "《JavaScript高级程序设计(第3版)》是JavaScript超级畅销书的最新版。ECMAScript 5和HTML5在标准之争中双双胜出，使大量专有实现和客户端扩展正式进入规范，同时也为JavaScript增添了很多适应未来发展的新特性。《JavaScript高级程序设计(第3版)》这一版除增加5章全新内容外，其他章节也有较大幅度的增补和修订，新内容篇幅约占三分之一。全书从JavaScript语言实现的各个组成部分——语言核心、DOM、BOM、事件模型讲起，深入浅出地探讨了面向对象编程、Ajax与Comet服务器端通信，HTML5表单、媒体、Canvas（包括WebGL）及Web Workers、地理定位、跨文档传递消息、客户端存储（包括IndexedDB）等新API，还介绍了离线应用和与维护、性能、部署相关的开发实践。《JavaScript高级程序设计(第3版)》附录展望了未来的API和ECMAScript Harmony规范。",
        "author": "Nicholas C. Zakas"
    },
    {
        "name": "深入理解Java虚拟机：JVM高级特性与最佳实践（第2版）",
        "describe": "第1版两年内印刷近10次，4家网上书店的评论近4?000条，98%以上的评论全部为5星级的好评，是整个Java图书领域公认的经典著作和超级畅销书，繁体版在台湾也十分受欢迎。第2版在第1版的基础上做了很大的改进：根据最新的JDK 1.7对全书内容进行了全面的升级和补充；增加了大量处理各种常见JVM问题的技巧和实践；增加了若干与生产环境相结合的实战案例；对第1版中的错误和不足之处的修正；等等。第2版不仅技术更新、内容更丰富，而且实战性更强。",
        "author": "周志明"
    },
    {
        "name": "JavaScript权威指南（第6版）",
        "describe": "本书要讲述的内容涵盖JavaScript语言本身，以及Web浏览器所实现的JavaScript API。本书更适合有一定编程经验的人阅读。对于那些希望学习JavaScript和已经开始使用JavaScript的程序员来说，如果想让自己对JavaScript语言和Web平台的理解和掌握再上一个台阶，本书最适合不过了",
        "author": "David Flanagan"
    },
    {
        "name": "编写高质量代码：改善Java程序的151个建议",
        "describe": "在通往“Java技术殿堂”的路上，本书将为你指点迷津！内容全部由Java编码的最佳实践组成，从语法、程序设计和架构、工具和框架、编码风格和编程思想五大方面，对Java程序员遇到的各种棘手的疑难问题给出了经验性的解决方案，为Java程序员如何编写高质量的Java代码提出了151条极为宝贵的建议。",
        "author": "秦小波"
    },
    {
        "name": "JavaScript语言精粹(修订版)",
        "describe": "《JavaScript语言精粹（修订版）》内 容 简 介 JavaScript 曾是“世界上最被误解的语言”，因为它担负太多的特性，包括糟糕的交互和失败的设计，但随着Ajax 的到来，JavaScript“从最受误解的编程语言演变为最流行的语言”，这除了幸运之外，也证明了它其实是一门优秀的语言。Douglas Crockford 在本书中剥开了JavaScript 沾污的外衣，抽离出一个具有更好可靠性、可读性和可维护性的JavaScript 子集，让你看到一门优雅的、轻量级的和非常富有表现力的语言。作者从语法、对象、函数、继承、数组、正则表达式、方法、样式和优美的特性这9 个方面来呈现这门语言真正的精华部分，通过它们完全可以构建出优雅高效的代码。作者还通过附录列出了这门语言的毒瘤和糟粕部分，且告诉你如何避免它们。最后还介绍了JSLint，通过它的检验，能有效地保障我们的代码品质。",
        "author": "Douglas Crockford"
    },
    {
        "name": "深入理解ES6",
        "describe": "ES6是迄今为止JavaScript内核首当其冲的一次重大更新。本书是领域大家Nicholas C. Zakas撰写的一份ES6的完整指南，书中详细讲解了ES 6在JavaScript对象类型、语法及其他方面激动人心的改变。每一章都含有可运行于任何JavaScript环境的示例代码，你可以利用这些代码测试、理解ES6中的新功能。无论你是Web开发者还是Node.js开发者，都可以通过本书来更好地理解和运用ES6，或是顺利地从ES5迁移到ES6。",
        "author": "Nicholas C. Zakas"
    },
    {
        "name": "Java开发实战经典",
        "describe": "本书从初学者的角度，以丰富的实例、案例，通俗易懂的语言，简单的图示，详细地介绍了Java开发中重点用到的多种技术。全书分为21章，包括需要重点掌握的：环境搭建、简单Java程序、JAVA基础程序设计、数组与方法、面向对象（基础篇）、面向对象（高级篇）、异常的捕获及处理、包及访问控制权限、Java常用类库、Java IO、Java类集、Java数据库编程；需要理解掌握的：多线程、泛型、枚举、Java反射机制、Annotation、Eclipse开发工具；需要了解掌握的：图形界面、Java 网络编程、JAVA新IO等内容。本书适合Java技术的初学者，也适合作为培训中心、计算机相关专业的参考书。",
        "author": "李兴华"
    },
    {
        "name": "编写可维护的JavaScript",
        "describe": "《编写可维护的JavaScript》向开发人员阐述了如何在团队开发中编写具备高可维护性的JavaScript代码，书中详细说明了作为团队一分子，应该怎么写JavaScript。书中内容涵盖了编码风格、编程技巧、自动化、测试等几方面，既包括具体风格和原则的介绍，也包括示例和技巧说明，最后还介绍了如何通过自动化的工具和方法来实现一致的编程风格。",
        "author": "Nicholas C. Zakas"
    },
    {
        "name": "JavaScript忍者秘籍",
        "describe": "JavaScript语言非常重要，相关的技术图书也很多，但没有任何一本书对JavaScript语言的重要部分（函数、闭包和原型）进行深入、全面的介绍，也没有任何一本书讲述跨浏览器代码的编写。本书是jQuery库创始人编写的一本深入剖析JavaScript语言的书。",
        "author": "John Resig & Bear Bibeault"
    },
    {
        "name": "ES6标准入门(第2版)",
        "describe": "ES6（又名 ES2105）是 JavaScript 语言的新标准，2015 年 6 月正式发布后，得到了迅速推广，是目前业界超级活跃的计算机语言。本书是国内仅有的一本 ES6 教程，在前版基础上增补了大量内容——对标准进行了彻底的解读，所有新增的语法知识（包括即将发布的 ES7）都给予了详细介绍，并且紧扣业界开发实践，给出了大量简洁易懂、可以即学即用的示例代码。",
        "author": "阮一峰 "
    },
    {
        "name": "Java面向对象编程(第2版) ",
        "describe": "本书采用由浅入深、与实际应用紧密结合的方式，利用大量经典实用的实例，详细讲解Java面向对象的编程思想、编程语法和设计模式，介绍常见Java类库的用法，总结优化Java编程的各种宝贵经验，深入阐述Java虚拟机执行Java程序的原理。本书的实例都基于最新的JDK8版本。本书的特色是以6条主线贯穿书：面向对象编程思想、Java语言的语法、Java虚拟机执行Java程序的原理、在实际项目中的运用、设计模式和性能优化技巧。另外，本书还贯穿了Oracle公司的OCJP（Oracle Certified Java Programmer）认证的考试要点。",
        "author": "孙卫琴"
    },
    {
        "name": "JavaScript设计模式",
        "describe": "设计模式是解决软件设计中常见问题的可复用方案。学习任何编程语言，设计模式都是一个令人兴奋和极具吸引力的话题。《JavaScript设计模式》是JavaScript设计模式的学习指南。全书分为14章。首先介绍了什么是模式、模式的结构、类别、模式的分类、如何编写模式等等；然后，集中介绍了很多流行的设计模式在JavaScript中的应用，包括Module(模块)模式、Observer(观察者)模式、Facade(外观)模式和Mediator(中介者)模式；最后，还探讨了模块化的JavaScript模式、jQuery及其插件中的设计模式。",
        "author": "Addy Osmani"
    },
    {
        "name": "HTML5与CSS3基础教程(第8版) ",
        "describe": "《HTML5与CSS3基础教程(第8版)》自第1版至今，一直是讲解HTML和CSS入门知识的经典畅销书，全面系统地阐述HTML5和CSS3基础知识以及实际运用技术，通过大量实例深入浅出地分析了网页制作的方方面面。最新第8版不仅介绍了文本、图像、链接、列表、表格、表单等网页元素，还介绍了如何为网页设计布局、添加动态效果等，另外还涉及调试和发布。《HTML5与CSS3基础教程(第8版)》提供了一个强大的配套网站，上面列出了书中的完整代码示例以及更多优秀实例及进阶参考资料，以供读者参考学习。 通过学习《HTML5与CSS3基础教程(第8版)》，零起点读者即可创建网站，而中高级水平的开发人员也可以快速了解HTML5新元素、CSS3的奇幻效果、响应式Web设计以及各种最佳实践。",
        "author": "Elizabeth Castro & Bruce Hyslop"
    },
    {
        "name": "CSS设计指南（第3版）",
        "describe": "《CSS设计指南(第3版)》是一本面向初中级读者的经典设计指南。全书共分8章，前4章分别介绍了HTML标记和文档结构、CSS工作原理、定位元素、字体和文本，对规则、声明、层叠、特指度、选择符等基本概念进行了详细解读。随后4 章介绍了页面布局、界面组件，CSS3圆角、阴影、渐变、多背景等视觉设计技巧，最后还对如何实现最前沿的响应式设计进行了通俗易懂的演示。",
        "author": "Charles Wyke-Smith"
    },
    {
        "name": "响应式Web设计:HTML5和CSS3实战",
        "describe": "移动互联网时代到来了。《响应式Web设计：HTML5和CSS3实战》将当前Web设计中热门的响应式设计技术与HTML5和CSS3结合起来，为读者全面深入地讲解了针对各种屏幕大小设计和开发现代网站的各种技术。不仅讨论了媒体查询、流式布局、相对字体、响应式媒体，更将HTML5和CSS3的相关知识点一并讲解，是学习最新Web设计技术不可多得的佳作。",
        "author": "Ben Frain"
    },
    {
        "name": "图解HTTP",
        "describe": "《图解HTTP》对互联网基盘——HTTP协议进行了全面系统的介绍。作者由HTTP协议的发展历史娓娓道来，严谨细致地剖析了HTTP协议的结构，列举诸多常见通信场景及实战案例，最后延伸到Web安全、技术动向等方面。《图解HTTP》的特色为在讲解的同时，辅以大量生动形象的通信图例，更好地帮助读者深刻理解HTTP通信过程中客户端与服务器之间的交互情况。读者可通过《图解HTTP》快速了解并掌握HTTP协议的基础，前端工程师分析抓包数据，后端工程师实现REST API、实现自己的HTTP服务器等过程中所需的HTTP相关知识点本书均有介绍。",
        "author": "上野宣"
    },
    {
        "name": "HTML+CSS网页设计与布局从入门到精通",
        "describe": "《HTML+CSS网页设计与布局从入门到精通》紧密围绕网页设计师在制作网页过程中的实际需要和应该掌握的技术，全面介绍了使用HTML和CSS进行网页设计和制作的各方面内容和技巧。 《HTML+CSS网页设计与布局从入门到精通》共分4个部分21章和两个附录，包括网页设计基础、HTML基础、CSS基础、CSS高级技术和CSS布局技术等内容。全书遵循Web标准，强调“表现”与“内容”的分离，抛弃了那些过时的HTML标记和属性，从更规范的角度全面、系统地介绍了网页设计制作方法与技巧。附录收录了网站发布与管理的知识和160个应用CSS时出现频度较高的英文单词及其中文解释。书中给出了大量详细的案例，并对案例进行分析，便于读者在理解的基础上，直接修改后使用。《HTML+CSS网页设计与布局从入门到精通》作者具备扎实的实践功底，行文细腻，对每一个技术细节以及每一个实际工作中可能遇到的难点和错误都进行了详细的说明，并给出了解决方案。",
        "author": "温谦"
    },
    {
        "name": "HTML与CSS入门经典(第8版)",
        "describe": "《HTML与CSS入门经典(第8版)》是畅销图书《HTML与CSS入门经典》的最新版，和过去的版本相同，本书仍然采用直观、循序渐进的方法来为读者讲解使用HTML与CSS创建并发布网页的过程，以方便读者掌握。《HTML与CSS入门经典(第8版)》总共分为24章和1个附录，其涵盖的内容有理解Web的工作方式，如何发布Web内容，理解HTML与XHTML的关系，理解层叠样式单(CSS)，使用文本块和列表，使用字体，使用表格显示信息，使用外部和内部链接，使用颜色，创建用于Web上的对象，在网站中使用对象和多媒体，使用框架，使用边距、填充、对齐和浮动，理解CSS盒子模型和定位，使用CSS进一步控制列表和控制导航，使用鼠标操作修改文本显示，创建固定或者流动的布局，创建打印友好的网页，理解动态网站，使用基于Web的表单，组织和管理网站，以及帮助人们找到你的网站等内容。附录还提供了完整的XHTML1.1与CSS2快速参考。",
        "author": "Julie C. Meloni Michael Morrison"
    },
    {
        "name": "Python编程 从入门到实践",
        "describe": "本书是一本针对所有层次的Python读者而作的Python入门书。全书分两部分：首部分介绍用Python 编程所必须了解的基本概念，包括matplotlib、NumPy和Pygal等强大的Python库和工具介绍，以及列表、字典、if语句、类、文件与异常、代码测试等内容；第二部分将理论付诸实践，讲解如何开发三个项目，包括简单的Python 2D游戏开发，如何利用数据生成交互式的信息图，以及创建和定制简单的Web应用，并帮读者解决常见编程问题和困惑。",
        "author": "Eric Matthes"
    },
    {
        "name": "C语言接口与实现--创建可重用软件的技术",
        "describe": "C语言接口与实现：创建可重用软件的技术》概念清晰、实例详尽，是一本有关设计、实现和有效使用C语言库函数，掌握创建可重用C语言软件模块技术的参考指南。书中提供了大量实例，重在阐述如何用一种与语言无关的方法将接口设计实现独立出来，从而用一种基于接口的设计途径创建可重用的API。",
        "author": "David R. Hanson"
    },
    {
        "name": "编程之美:微软技术面试心得",
        "describe": "《编程之美:微软技术面试心得》是一本让人着迷的书！阅读起来。有些题目的内容会引起强烈的共鸣，尤其是那些自己非常熟悉并且又深知解答的题目；也有一些题目让我异常惊诧，原来除了我所知道的解答思路之外，还有更好的解答以及更深层次的原因。还有一些题目是从来没想到过的。阅读过程是一次愉快的享受，也是脑细胞持续活跃的过程。",
        "author": "《编程之美》小组"
    },
    {
        "name": "Android编程权威指南",
        "describe": "Big Nerd Ranch是美国一家专业的移动开发技术培训机构，《Android编程权威指南》主要以训练营的5天教学课程为基础，融合了两位作者多年的心得体会，是一本完全面向实战的Android 编程权威指南。《Android编程权威指南》共37章，详细介绍了GeoQuiz、HelloMoon、DragAndDraw等8个Android应用。这些应用的难易程度不一，最复杂的CriminalIntent应用占用了13章的篇幅。通过这些精心设计的应用，读者可掌握很多重要的理论知识和开发技巧，获得最前沿的开发经验。",
        "author": "Bill Phillips & Brian Hardy"
    },
    {
        "name": "流畅的Python",
        "describe": "《流畅的Python》一书致力于帮助Python开发人员挖掘这门语言及相关程序库的优秀特性，避免重复劳动，同时写出简洁、流畅、易读、易维护，并且具有地道Python风格的代码。本书尤其深入探讨了Python语言的高级用法，涵盖数据结构、Python风格的对象、并行与并发，以及元编程等不同的方面。",
        "author": "Luciano Ramalho"
    },
    {
        "name": "PHP编程基础与实例教程 ",
        "describe": "PHP简单易学且功能强大，是开发WEB应用程序理想的脚本语言。本书由浅入深、循序渐进，系统地介绍了PHP的相关知识及其在WEB应用程序开发中的实际应用，并通过具体案例，使读者巩固所学知识，更好地进行开发实践。本书共分为13章，涵盖了PHP开发环境的搭建、PHP语法、FORM表单、数据库设计、PHP与数据库连接、会话控制、界面设计等内容。",
        "author": "孔祥盛"
    },
    {
        "name": "C语言点滴",
        "describe": "C语言兼具高级语言和汇编语言的特点，学习起来难度较大，令不少初学者望而生畏。同时，C语言又是一门应用非常广泛的编程语言，在实际应用中如何根据不同的应用场景高效地使用C语言，也是大家非常感兴趣的话题。",
        "author": "赵岩"
    },
    {
        "name": "Linux环境编程：从应用到内核",
        "describe": "本书的写作布局正是以APUE的章节作为参考，针对Linux环境，不仅对用户空间的接口进行阐述，同时还引导读者分析该接口在内核的源码实现，使得读者不仅可以知道接口怎么用，同时还可以理解接口是怎么工作的。对于Linux的系统调用，做到知其然，知其所以然。",
        "author": "高峰 & 李彬"
    },
    {
        "name": "Linux系统编程(第2版)",
        "describe": "系统编程是指编写系统软件，其代码在底层运行，直接跟内核和核心系统库对话。 　　《Linux系统编程(第2版)》是一本关于Linux系统编程的教程，也是一本介绍Linux系统编程的手册，还是一本如何实现更优雅更快代码的内幕指南。全书分为11章和2个附录，详细介绍了Linux系统编程基本概念、文件I/O、缓冲I/O、高级文件I/O、进程管理、高级进程管理、线程、文件和目录管理、信号和时间等主题。附录给出了gcc和GNU C提供的很多语言扩展，以及推荐阅读的相关书目。",
        "author": "Robert Love"
    },
    {
        "name": "Java 8实战",
        "describe": "本书全面介绍了Java 8 这个里程碑版本的新特性，包括Lambdas、流和函数式编程。有了函数式的编程特性，可以让代码更简洁，同时也能自动化地利用多核硬件。全书分四个部分：基础知识、函数式数据处理、高效Java 8 编程和超越Java 8，清晰明了地向读者展现了一幅Java 与时俱进的现代化画卷。",
        "author": "Raoul-Gabriel Urma & Mario Fusco & Alan Mycroft"
    },
    {
        "name": "UNIX环境高级编程(第3版)",
        "describe": "本书是被誉为UNIX编程“圣经”的Advanced Programming in the UNIX Environment一书的第3版。在本书第2版出版后的8年中，UNIX行业发生了巨大的变化，特别是影响UNIX编程接口的有关标准变化很大。本书在保持前一版风格的基础上，根据最新的标准对内容进行了修订和增补，反映了最新的技术发展。书中除了介绍UNIX文件和目录、标准I/O库、系统数据文件和信息、进程环境、进程控制、进程关系、信号、线程、线程控制、守护进程、各种I/O、进程间通信、网络IPC、伪终端等方面的内容，还在此基础上介绍了众多应用实例，包括如何创建数据库函数库以及如何与网络打印机通信等。此外，还在附录中给出了函数原型和部分习题的答案。",
        "author": "W. Richard Stevens & Stephen A. Rago"
    },
    {
        "name": "Linux/UNIX系统编程手册(上、下册)",
        "describe": "《Linux/UNIX系统编程手册(上、下册)》是介绍Linux与UNIX编程接口的权威著作。Linux编程资深专家Michael Kerrisk在书中详细描述了Linux/UNIX系统编程所涉及的系统调用和库函数，并辅之以全面而清晰的代码示例。《Linux/UNIX系统编程手册(上、下册)》涵盖了逾500个系统调用及库函数，并给出逾200个程序示例，另含88张表格和115幅示意图。",
        "author": "Michael Kerrisk"
    },
    {
        "name": "JavaScript编程全解",
        "describe": "《JavaScript编程全解》涵盖了JavaScript开发中各个方面的主题，对从客户端及服务器端JavaScript等基础内容，到HTML5、Web API、Node.js与WebSocket等热门技术，都作了深入浅出的介绍与说明。读者能够通过本书了解当今JavaScript开发的最新现状。《JavaScript编程全解》的一大特色是对JavaScript语言的语法规则进行了细致的说明，并通过大量纯正的JavaScript风格代码，帮助读者准确地掌握JavaScript的语言特性及细节用法。",
        "author": "井上诚一郎 & 土江拓郎"
    },
    {
        "name": "MySQL技术内幕：SQL编程",
        "describe": "本书是畅销书《MySQL技术内幕：InnoDB存储引擎》的姊妹篇，深刻揭示了MySQL中SQL编程的精髓与奥秘，能为开发者和DBA们利用SQL语言解决各种与开发和管理相关的MySQL难题提供很好的指导和帮助。网易CEO丁磊和多位数据库专家隆重推荐。全书一共10章，全面探讨了MySQL中SQL编程的各种方法、技巧与最佳实践。第1章首先介绍了SQL编程的概念、数据库的应用类型以及SQL查询分析器，然后介绍了SQL编程的三个阶段，希望读者通过本书的学习能达到最后的融合阶段。第2章全面讲解了MySQL中的各种数据类型和与之相对应的各种编程问题。第3章深入探讨了逻辑查询与物理查询的原理与方法。",
        "author": "姜承尧"
    },
    {
        "name": "Node.js实战",
        "describe": "《Node.js实战》是Node.js的实战教程，涵盖了为开发产品级Node应用程序所需要的一切特性、技巧以及相关理念。从搭建Node开发环境，到一些简单的演示程序，到开发复杂应用程序所必不可少的异步编程。书中还介绍了HTTP API的应用技巧等。",
        "author": "Mike Cantelon & Marc Harter"
    },
    {
        "name": "Node.js进阶之路",
        "describe": "本书内容涵盖了 Node.js高并发的原理、源码分析以及使用 Node.js开发应用所需要的不同层面的技术实践。具体来讲，本书包括 Node.js异步机制（配以源码分析）、编辑与调试、测试技术、Docker 部署、模块机制、V8 引擎与代码优化、Promise 和 ES6 Generator、LoopBack 开源框架、使用 C++ 编写扩展、JavaScript严格模式、编码规范等内容。在 LoopBack 章节，本书详细介绍了使用此框架开发企业级 Web 应用的步骤，帮助读者迅速掌握使用这个强大框架的诀窍。最后一章详细介绍了编写不同类型的 C++ 模块的知识，并对堆内存管理等内容做了深入探讨。",
        "author": "尤嘉"
    },
    {
        "name": "Node与Express开发",
        "describe": "本书系统讲解了使用Express开发动态Web应用的流程和步骤。作者不仅讲授了开发公共站点及REST API的基础知识，同时还讲解了构建单页、多页及混合Web应用的规划方式及最佳实践。具体而言，第1~5章介绍Node 和Express，搭建一个示例网站的骨架，讨论测试和QA。第6~12章介绍Node中更重要的结构，讲解模板，介绍cookies、会话和表单处理器，探讨中间件以及从服务器发送电子邮件。第13~15章讨论持久化、URL路由、API的编写、流行的MVC范式。第18~22章讨论安全、社交媒体集成以及网站的调试、启用和维护。",
        "author": "Ethan Brown"
    },
    {
        "name": "Node.js微服务",
        "describe": "本书对如何采用Node.js及其生态工具进行微服务开发的最好实践做了全面的介绍，内容包括对微服务架构基本概念及设计原则的讲解，以及如何采用Node.js搭配Seneca、PM2和Docker等现代化工具来构建、测试、监控以及部署轻量级微服务，同时也阐述了Node.js在微服务实践中所涉及的相关概念，并就微服务的优缺点、文档化、安全性以及可追溯性等主题进行了探讨。",
        "author": "David Gonzalez"
    },
    {
        "name": "Node.js区块链开发",
        "describe": "亿书是完全开放开源的项目，是一个完整的类比特币的区块链产品。本书基于该项目，完全以实用为目的，将开发实践贯穿始终，内容涉及开发区块链产品前端、后台和桌面应用的全过程。本书用开发的思维进行反复迭代，由浅入深，详细介绍了区块链技术相关理论知识、Node.js前后台开发基础知识、加密签名技术、P2P网络实现、共识算法等，能帮助初学者快速学习入门区块链技术，深入掌握Node.js编程开发技术，帮助区块链技术从业者、Web开发者更深刻地理解相关概念和技术实现。",
        "author": "朱志文"
    },
    {
        "name": "React全栈：Redux+Flux+webpack+Babel整合开发",
        "describe": "本书从现代前端开发的标准、趋势和常用工具入手，由此引出了优秀的构建工具webpack 和JavaScript库React，之后用一系列的实例来阐述两者的特色、概念和基本使用方法。随着应用复杂度的增加，进而介绍了Flux 和Redux 两种架构思想，并且使用Redux 对现有程序进行改造，最后介绍了在开发过程中出现的反模式和性能优化方法。",
        "author": "张轩 & 杨寒星"
    },
    {
        "name": "Vue2实践揭秘",
        "describe": "本书以Vue2的实践应用为根基，从实际示例入手，详细讲解Vue2的基础理论应用及高级组件开发，通过简明易懂的实例代码，生动地让读者快速、全方位地掌握Vue2的各种入门技巧以及一些在实际项目中的宝贵经验。本书除了全面、细致地讲述Vue2的生态结构、实际编程技巧和一些从实践中得到的经验，还重点介绍如何以组件化编程思想为指导，以前端工程化方法为实现手段来实践Vue2，通过组件的单元测试和E2E测试来保证工程质量。",
        "author": "梁睿坤"
    },
    {
        "name": "Learning Vue.js 2",
        "describe": "Learn how to propagate DOM changes across the website without writing extensive jQuery callbacks code. Learn how to achieve reactivity and easily compose views with Vue.js and understand what it does behind the scenes. Explore the core features of Vue.js with small examples, learn how to build dynamic content into preexisting web applications, and build Vue.js applications from scratch.",
        "author": "Olga Filipova"
    },
    {
        "name": "Angular权威教程",
        "describe": "本书堪称Angular领域的里程碑式著作，涵盖了关于Angular的几乎所有内容。对于没有经验的人，本书平实、通俗的讲解，递进、严密的组织，可以让人毫无压力地登堂入室，迅速领悟新一代Web应用开发的精髓。如果你有相关经验，那本书对Angular概念和技术细节的全面剖析，以及引人入胜、切中肯綮的讲解，将帮助你彻底掌握这个框架，在自己职业技术修炼之路上更进一步。",
        "author": "Ari Lerner & Felipe Coury"
    },
    {
        "name": "乌合之众：大众心理研究",
        "describe": "本书作者是法国著名社会心理学家，自1894年始，写下一系列社会心理学著作，以本书最为著名；在社会心理学领域已有的著作中，最有影响的，也是这本并不很厚的《乌合之众》。作者论述在传统社会因素毁灭、工业时代巨变的基础上，“群体的时代”已经到来。书中极为精致地描述了集体心态，对人们理解集体行为的作用以及对社会心理学的思考发挥了巨大影响。《乌合之众--大众心理研究》在西方已印至第29版，其观点新颖，语言生动，是群体行为的研究者不可不读的佳作。",
        "author": "古斯塔夫.勒庞、 冯克利"
    },
    {
        "name": "自控力",
        "describe": "《自控力》一书以凯利·麦格尼格尔博士在斯坦福大学继续教育项目开“意志力科学”为基础，吸收了心理学、神经学和经济学等学科的最新洞见，参与过这门课程的人称其能够“改变一生”。本书为读者提供了清晰的框架，讲述了什么是自控力，自控力如何发生作用，以及为何自控力如此重要。作为一名健康心理学家，凯利·麦格尼格尔博士的工作就是帮助人们管理压力，并在生活中做出积极的改变。多年来，通过观察学生们是如何控制选择的，她意识到，人们关于自控的很多看法实际上妨碍了我们取得成功。",
        "author": "Kelly McGonigal"
    },
    {
        "name": "自卑与超越",
        "describe": "本书是人类心理学先驱阿弗雷德•阿德勒的巅峰著作，全书立足于个体心理学观点，从教育、家庭、婚姻、伦理、社交等多个领域，以大量的实例为论述基础，阐明了人生道路的方向和人生意义的真谛，帮助人们正确面对缺陷，正确对待职业，正确理解社会，理解生活，理解性。具有极深的哲理性和巨大的学术价值。",
        "author": "阿弗雷德•阿德勒"
    },
    {
        "name": "微时间管理术",
        "describe": "追求高效率已经成为许多人必要的人生课题，因为每天都有太多事要做，包括工作、家庭、朋友、社会……还有自己小小的梦想。你有多少明明知道却来不及处理和实现的事，现在你可以用每天18分钟把它们找回来。",
        "author": "大师轻松读"
    },
    {
        "name": "微表情心理学",
        "describe": "为什么每次谈判，你小心翼翼、如履薄冰，却仍在不知不觉中被人看穿？为什么每次约会，你都无法走进TA的大脑、弄清TA在想什么，最终不欢而散？为什么你明明很努力却得不到应有的赏识和回报，而那个比你“懒惰”的人却能步步高升？为什么你总是不知道自己为什么这样，或者为什么那样？ 　　本书要告诉你的，就是关于这些“为什么”的真相，以及如何运用这些真相，使事业更成功，使人生更幸福。",
        "author": "哈里·巴尔肯"
    },
    {
        "name": "给你一个团队，你能怎么管？",
        "describe": "作者用他参与海外上市公司与国内民营企业管理的亲身经历，分享团队的建设与管理经验。他通过简洁有趣的描述，翔实动人的案例，为我们揭示管理的真相，告诉你应该如何建设和管理一个团队，内容富有系统性与针对性，简单易懂，容易上手，尖锐深刻。 团队管理，这是一个简单直接但又让许多人充满困惑的命题。说它简单，是因为团队无非只有三个条件：自主性，思考性和协作性。只要使你手底下的这帮人充分具备了这三大要素，一个合格的团队就建立了，它随着你的指挥棒冲锋陷阵，无所不至。但让很多管理者困惑的是，在实际的执行中，人们会遇到诸多现实而无奈的困境，会发现情况并非如此，原来还有这么多潜在的未知的问题。人性的种种缺陷，往往让团队的组建和管理面临无穷大的风险，不管你脚下是一家无足轻重的小公司，还是世界500强企业，他们的中高层领导者及员工本身都有这种苦恼。即，你明明身在团队，却感受不到一支成熟强大的团队的支撑，经常孤军奋战，陷入苦斗，多倍付出，却只能得到可怜微少之回报。",
        "author": "赵伟"
    },
    {
        "name": "管理学：原理与实践（原书第8版）",
        "describe": "本书是一本优秀的管理学教材，在世界许多国家和地区受到欢迎。全书以管理过程为框架，按照计划、组织、领导和控制四种基本管理职能，对管理的各个方面做了详尽的阐述。",
        "author": "Stephen P.Robbins & David A.Decenzo"
    },
    {
        "name": "斯坦福极简经济学",
        "describe": "公式复杂、术语晦涩的经济学教材，让你望而生畏吗？ 在凡事有得必有失的世界里，我们如何权衡取舍？ 斯坦福大学很受欢迎的经济学教授，带你看懂复杂世界的真实运作！ 《时代周刊》引述率高的关键经济知识！ 《图书馆杂志》年度商业书！",
        "author": "泰勒"
    },
    {
        "name": "精进：如何成为一个很厉害的人",
        "describe": "盲目的努力，只是一种缓慢的叠加。 在《精进：如何成为一个很厉害的人》中，作者提出了一种更有效的提升自我的方法：用持续精确的努力，撬动更大的可能，这便是精进。 这本书为大家提供了时间、选择、行动、学习、思维、才能、成功七个方面的精进路径，只要依循书中的方法反复磨练，便可以日益精进，成为一个很厉害的人，找到实现自我的那条成功之道。",
        "author": "采铜"
    },
    {
        "name": "从零开始读懂经济学",
        "describe": "经济学往大了说是“经世济民之学”，往小了说是“经济实惠之学”，人人都能从经济学中淘到自己需要的宝贝。对个人来说，经济学是一门高明的成功学与幸福学。经济学能解决生活中的疑惑，不仅能告诉人们“是什么”，还能告诉人们“为什么”以及“怎么办”。此书说经济学爱好者的首选读本。",
        "author": "斯凯恩"
    },
    {
        "name": "西方哲学简史",
        "describe": "《西方哲学简史》是英国哲学家、逻辑学家、数学家伯特兰•罗素的代表作之一，记述了从西方哲学萌芽的古希腊哲学一直到二十世纪早期期西方哲学的发展历程。《西方哲学简史》中以各个哲学流派及其代表哲学家为中心记述西方哲学哲学的发展历程，同时也对各个哲学流派产生的历史背景、哲学家的生活时代加以描述，以使读者更好地理解西方哲学的发展历程，并明白作为形而上的哲学的产生与发展，都有其深厚的社会政治经济背景，是它们发展的产物。",
        "author": "伯特兰·罗素 & 文利"
    },
    {
        "name": "老子",
        "describe": "老子，又称老聃、李耳，汉族，春秋时期楚国苦县厉乡曲仁里人，是我国古代伟大的哲学家和思想家，道家学派创始人。其被唐皇武后封为太上老君，世界文化名人，世界百位历史名人之一，存世有《道德经》（又称《老子》）。其作品的精华是朴素的辨证法，主张无为而治，其学说对中国哲学发展具有深刻影响。在道教中老子被尊为道祖。",
        "author": "李耳"
    },
    {
        "name": "古希腊哲学研究传统",
        "describe": "《古希腊哲学研究传统》系北京大学西方伦理学研究生陆炎在翻译《古希腊哲学简史》一书时，为该书撰写的导读。 《古希腊哲学研究传统》共分三个部分： 其一：西方古希腊哲学研究传统和现状。指出了古希腊哲学对西方发展的重大影响，在西方思想发展的每个关节点，重新思考古希腊哲学提出的问题都具有核心重要性，成为西方思想发生转变的关键。 其二：国内古希腊哲学研究传统和现状。从中国初接触古希腊哲学的明末清初（利玛窦来华）开始梳理，按时间顺序阐述了其研究派别及代表人物。 其三：《古希腊哲学简史》一书的特点和凡例。这本为大学和人文爱好者编写的精简的希腊哲学入门读物，虽然书名是“哲学”史，但在哲学观点，作者也注重引导学生思考哲学与历史、政治制度的关系。",
        "author": "陆炎"
    },
    {
        "name": "演讲与口才:知识大全集",
        "describe": "《演讲与口才:知识大全集》内容简介：戴尔·卡耐基说：“假如你的口才好……可以使人家喜欢你。可以结交好的朋友，可以开辟前程，使你获得幸福。譬如你是一个律师，它便吸引了一切诉讼的当事人；你是一个店主。它帮助你吸引顾客。”“有许多人。因为他善于辞令，因此而擢升了职位……有许多人因此而获得荣誉，获得了厚利。你不要以为这是小节，你的一生，有一大半的影响，由于说话艺术。”",
        "author": "雅瑟"
    },
    {
        "name": "5分钟掌控听众:当众讲话的诀窍",
        "describe": "《5分钟掌控听众:当众讲话的诀窍》讲话能力是训练出来的，作者从多年的演讲和培训实践中，总结出一套完整的“当众讲话特训方案”，教你把握发言的机会，善用讲话的力量。这套方法曾经帮助众多职场人赢得晋升机会，帮助众多销售员达成完美交易，也曾帮助众多讲师赢得学员的信赖和尊敬。即使只是部门会议上的发言，这套方法也帮助过成千上万的人争取到了上司的支持。",
        "author": "易书波"
    },
    {
        "name": "魅力口才与演讲的艺术",
        "describe": "《卡耐基魅力口才与演讲的艺术》内容简介：任何说话技巧在实施之前，必须树立充分的自信心。因为自信心给人一种安全感，使你敢于与他人相处，并在任何非自由场合自由发表自己的看法。一旦你的思想表达中充满了激情，那么即使在很小的场合，你也会努力地搜索以前的经验，并以此作为谈资。",
        "author": "Carnegie D"
    },
    {
        "name": "TED演讲的8个秘诀:学习18分钟高效表达",
        "describe": "世界著名的智慧传播组织TED汇聚了世界各地精英，他们在TED讲述自己的成功之道，并在最短的时间内将这些人生智慧传递给需要的人。世界上最成功的人，不是仅有想法的人，而是有想法，又能正确表达出来为人所了解的人。纵观职场、商海的成功者，无不是这条法则的遵循者与践行者。本书通过八个方面阐述TED的演讲智慧，告诉读者如何表达自己及如何准确快速传达出构想和心中的蓝图并将其变为现实，展开行动，进而在销售中、在面试中、在商讨方案中、在商务谈判中胜出。",
        "author": "宋豫书"
    },
    {
        "name": "红楼梦",
        "describe": "《红楼梦》是一部百科全书式的长篇小说。以宝黛爱情悲剧为主线，以四大家族的荣辱兴衰为背景，描绘出18世纪中国封建社会的方方面面，以及封建专制下新兴资本主义民主思想的萌动。结构宏大、情节委婉、细节精致，人物形象栩栩如生，声口毕现，堪称中国古代小说中的经典。 《红楼梦》是一部具有高度思想性和高度艺术性的伟大作品，从《红楼梦》反映的思想倾向来看，作者具有初步的民主主义思想，他对现实社会包括宫廷及官场的黑暗，封建贵族阶级及其家庭的腐朽，封建的科举制度、婚姻制度、奴婢制度、等级制度，以及与此相适应的社会统治思想即孔孟之道和程朱理学、社会道德观念等等，都进行了深刻的批判并且提出了朦胧的带有初步民主主义性质的理想和主张。这些理想和主张正是当时正在滋长的资本主义经济萌芽因素的曲折反映。",
        "author": "曹雪芹"
    },
    {
        "name": "三国演义",
        "describe": "全称《三国志通俗演义》，是中国小说史上长篇章回小说的开山之作。小说以公元184至280年间自黄巾起义至西晋统一的历史故事为素材，用规模宏大的结构和虚实结合的手法，集中描写了魏、蜀、吴三国统治集团之间政治、军事、外交的种种斗争。生动地揭示了统治阶级内部尔虞我诈的勾结与你死我活的斗争的同时，也塑造了一批或智、或忠、或义的生动形象。",
        "author": "罗贯中"
    },
    {
        "name": "西游记",
        "describe": "《西游记》是中国古典四大名著之一，由吴承恩编写而成。此书描写的是孙悟空、猪八戒、沙悟净保护唐僧西天取经的传奇故事。作者通过虚幻的世界，对封建统治者的态度颇可玩味，在《西游记》中，简直找不出一个称职的皇帝。如来佛祖所创佛教，僧人自然不能以钱财所迷，可是佛祖竟然默许手下人收取贿赂，这反映封建社会官官相护的黑暗情景。",
        "author": "吴承恩"
    },
    {
        "name": "水浒传",
        "describe": "水浒传是一部反映农民起义的长篇小说，它描写了108个好汉从贫民被逼上梁山到与朝廷抗争最后失败的全过程，它不仅展示了农民起义在发展过程中的燎原之势和市井平民与封建势力展开英勇斗争的全过程，也写出了起义的悲剧结局。小说揭露了封建统治的罪恶事实，揭示了农民起义的社会根源，成功地塑造了起义英雄血肉丰满，栩栩如生的光辉形象",
        "author": "施耐庵"
    },
    {
        "name": "哈姆雷特",
        "describe": "《哈姆雷特》一直以来被誉为莎士比亚的巅峰之作。这部作品叙述了丹麦王子哈姆莱特为父报仇的故事。哈姆莱特在德国读书时，他的叔父克劳狄斯毒死老哈姆莱特，篡夺了王位，并霸占了哈姆莱特的母亲。哈姆莱特回国后，决定为父报仇。结果他误杀了情人奥非利娅的父亲，奥菲利娅因此疯癫自尽。国王乘机挑拨波洛涅斯的儿子雷欧提斯以比剑为名，设计用毒剑刺死了哈姆莱特。该剧的结尾，哈姆莱特、国王、王妃、雷欧提斯同归于尽。",
        "author": "莎士比亚"
    },
    {
        "name": "鬼谷子",
        "describe": "《鬼谷子》有四大理由典藏，一是重要的地位：两千年的谋略学巨著，中国传统文化中的奇葩。二实用的口才：一人之辩重于九鼎之宝，三寸之舌强于百万之师。三精深的智慧：智用于众人之所不能知，谋用于众人之所不能用。四精美的收藏：内容精辟独到，版式新颖，实为收藏品读之首选。",
        "author": "鬼谷子"
    },
    {
        "name": "彷徨",
        "describe": "《彷徨》鲁迅先生写作于“五·四”运动后新文化阵营分化的时期（1924年至1925年间）的短篇小说集，收入11篇，表现了他在这一时期在革命征途上探索的心情。",
        "author": "鲁迅"
    },
    {
        "name": "战国策",
        "describe": "本书是一部国别体史书。全书按东周、西周、秦国、齐国等依次编写，分为12策，33卷，共497篇。所记载的历史，上起前490年智伯灭范氏，下至前221年秦统一，主要记述了战国时期的纵横家的政治主张和策略，展示了战国时代的历史特点和社会风貌。该书文辞优美、语言生动，富于雄辩与运筹机智，描写人物绘声绘色，在我国古典文学史上占有重要地位，同时对司马迁《史记》纪传体的形成，具有很大影响。",
        "author": "刘向"
    },
    {
        "name": "史记",
        "describe": "司马迁，西汉史学家、思想家、文学家。《史记》，或称“太史公书”，或称“太史公传”，也称“太史公”，是中国第一部纪传体通史。记载了上自中国上古传说中的黄帝时代，下至汉武帝元狩元年共3000多年的历史。全书共一百三十篇，包括：十二本纪、十表、八书、三十世家、七十列传。司马迁“究天人之际，通古今之变，成一家之言。”《史记》与《资治通鉴》并称为“史学双璧”，鲁迅先生赞誉为“史家之绝唱，无韵之离骚”。",
        "author": "司马迁"
    },
    {
        "name": "巴黎圣母院",
        "describe": "《巴黎圣母院》艺术地再现了四百多年前法国路易十一统治时期的黑暗.宫廷与教会如何狼狈为奸压迫百姓，百姓怎样同两股势力英勇斗争。书中描写吉普赛少女爱斯美拉达以街头卖艺为生，圣母院教堂副主教弗罗洛欲将其占为己有,但发现她另有情人，于是设计刺杀了她的情人并嫁祸于她，致使她被判死刑。但敲钟人卡西魔多把她救到圣母院避难……小说情节引人入胜，执著的爱情催人泪下。",
        "author": "维克多·雨果(Hugo.V.)"
    },
    {
        "name": "傲慢与偏见",
        "describe": "《傲慢与偏见》讲述一个恃才傲物狂放不羁，一个聪颖美丽却心存偏见，千回百转，历经种种心灵涤荡，爱情——终如芙蓉般在清澈的湖水中，静静地含露绽放。 一个终生未嫁的女人写的一本关于爱情和婚姻的书，或者说是她对爱情和婚姻隔岸观火式的理解，这《傲慢与偏见》就是《傲慢与偏见》，一部到现在仍为绝大数人所喜爱的书。其人物刻画细致入微，恩怨爱憎、人生百态尽跃纸上，轻描淡写恰到好处。全书风格优美而平和，正如人所说，这《傲慢与偏见》“在写作上是完美的，没有遗漏也没有放纵”。 这是一部具有浪漫主义情调的英国著名爱情喜剧小说。",
        "author": "简•奥斯汀"
    }
]